In [3]:
import pandas as pd
import numpy as np
import re

In [4]:
df = pd.read_csv("../data/batting_summary.csv")

In [5]:
df.head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.300
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.300

In [6]:
# Handling Non-numeric case

In [7]:
df["Strike_Rate"] = pd.to_numeric(df["Strike_Rate"].str.replace('-', ''), errors="coerce").fillna(0.00)

In [8]:
df["Strike_Rate"] = df["Strike_Rate"].astype(float)

In [9]:
df.head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.3
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.3

In [10]:
# Sort dataframe based on Match_no & Batting_Position

In [11]:
df.sort_values(by=["Match_no", "Batting_Position"], ascending=[False, True]).head(5)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate
899,48,India vs Australia,India,Rohit Sharma,1,c Travis Head b Glenn Maxwell,47,31,4,3,151.613
910,48,India vs Australia,Australia,David Warner,1,c Virat Kohli b Mohammed Shami,7,3,1,0,233.333
900,48,India vs Australia,India,Shubman Gill,2,c Adam Zampa b Mitchell Starc,4,7,0,0,57.143
911,48,India vs Australia,Australia,Travis Head,2,c Shubman Gill b Mohammed Siraj,137,120,15,4,114.167
901,48,India vs Australia,India,Virat Kohli,3,b Pat Cummins,54,63,4,0,85.714

In [12]:
df.columns

Index(['Match_no', 'Match_Between', 'Team_Innings', 'Batsman_Name',
       'Batting_Position', 'Dismissal', 'Runs', 'Balls', '4s', '6s',
       'Strike_Rate'],
      dtype='object')

In [13]:
df.dtypes

Match_no              int64
Match_Between        object
Team_Innings         object
Batsman_Name         object
Batting_Position      int64
Dismissal            object
Runs                  int64
Balls                 int64
4s                    int64
6s                    int64
Strike_Rate         float64
dtype: object

In [14]:
# Get the list of All unique matches

In [15]:
df[["Match_Between"]].drop_duplicates().tail()

               Match_Between
829  Bangladesh vs Australia
843      England vs Pakistan
865     India vs Netherlands
882     India vs New Zealand
899       India vs Australia

In [16]:
# Add "rank" column based on existing column on dataframe

In [17]:
df["Rank"] = df["Match_no"].rank(ascending=False).astype(int)

In [18]:
df.head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.3,909
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.3,909

In [19]:
df[["Match_no", "Match_Between","Rank"]].drop_duplicates().head()

    Match_no              Match_Between  Rank
0          1     England vs New Zealand   909
14         2    Pakistan vs Netherlands   891
36         3  Afghanistan vs Bangladesh   872
53         4  South Africa vs Sri Lanka   854
71         5         Australia vs India   837

In [20]:
# Number of matches played by each team

In [21]:
df[["Match_no", "Team_Innings"]].drop_duplicates().Team_Innings.value_counts()

Team_Innings
Australia       11
India           11
New Zealand     10
South Africa    10
England          9
Pakistan         9
Netherlands      9
Afghanistan      9
Bangladesh       9
Sri Lanka        9
Name: count, dtype: int64

In [22]:
df[["Match_no", "Team_Innings"]].drop_duplicates().groupby(["Team_Innings"]).count()

              Match_no
Team_Innings
Afghanistan          9
Australia           11
Bangladesh           9
England              9
India               11
Netherlands          9
New Zealand         10
Pakistan             9
South Africa        10
Sri Lanka            9

In [23]:
# Get the number of matches played by Team India

In [24]:
df_grp = df[["Match_no","Match_Between","Team_Innings"]].drop_duplicates().groupby(["Team_Innings"])

In [25]:
df_grp.get_group("India")

     Match_no          Match_Between Team_Innings
82          5     Australia vs India        India
156         9   Afghanistan vs India        India
267        12      Pakistan vs India        India
362        17    Bangladesh vs India        India
438        21   New Zealand vs India        India
578        29       India vs England        India
648        33     India vs Sri Lanka        India
717        37  India vs South Africa        India
865        45   India vs Netherlands        India
882        46   India vs New Zealand        India
899        48     India vs Australia        India

In [26]:
df_grp.get_group("India").Team_Innings.count()

11

In [27]:
# Find Numebr of 4s and 6s hit by batsman

In [28]:
df_4s = df[["Batsman_Name","4s"]].groupby(["Batsman_Name"])["4s"].sum()
df_6s = df[["Batsman_Name","6s"]].groupby(["Batsman_Name"])["6s"].sum()

In [29]:
df_4s.head(2)

Batsman_Name
Abdullah Shafique    36
Adam Zampa            6
Name: 4s, dtype: int64

In [30]:
df_6s.tail(2)

Batsman_Name
Wesley Barresi    1
Will Young        6
Name: 6s, dtype: int64

In [31]:
pd.concat([df_4s, df_6s], axis=1).sort_values(by="6s", ascending=False).head()

                 4s  6s
Batsman_Name
Rohit Sharma     66  31
David Warner     53  28
Quinton de Kock  65  26
David Miller     34  26
Shreyas Iyer     37  24

In [32]:
pd.concat([df_4s, df_6s], axis=1).sort_values(by=["4s","6s"], ascending=[False,False]).head()

                 4s  6s
Batsman_Name
Virat Kohli      68   9
Rohit Sharma     66  31
Quinton de Kock  65  26
Rachin Ravindra  55  17
Devon Conway     54   4

In [33]:
# Strike rate by Batsman_Name

In [34]:
df_sr = df[["Batsman_Name","Strike_Rate"]].groupby(["Batsman_Name"]).mean(numeric_only=True)

In [35]:
df_sr.head(2)

                   Strike_Rate
Batsman_Name
Abdullah Shafique    71.388875
Adam Zampa           74.304571

In [36]:
df_sr.sort_values(by="Strike_Rate", ascending=False).head()

               Strike_Rate
Batsman_Name
David Willey    163.932667
Aiden Markram   141.043000
Hardik Pandya   137.500000
Rohit Sharma    127.904091
Gus Atkinson    122.233333

In [37]:
# No of records in dataframe

In [38]:
df.index

RangeIndex(start=0, stop=916, step=1)

In [39]:
len(df.index)

916

In [40]:
# Squeeze will squeeze single row dataframe into Series
# Squeeze will squeeze series into scalars
dfs = pd.read_csv("../data/batting_summary.csv", usecols=["Team_Innings"]).squeeze(axis=1)

In [41]:
dfs.head(4)

0    England
1    England
2    England
3    England
Name: Team_Innings, dtype: object

In [42]:
def check_india(ind):
	if ind == "India":
		return True
	else:
		return False

In [43]:
check_india("India")

True

In [44]:
dfs.apply(check_india).head()

0    False
1    False
2    False
3    False
4    False
Name: Team_Innings, dtype: bool

In [45]:
# Get all innings by Rohit

In [46]:
df[df["Batsman_Name"] == "Rohit Sharma"].head()

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
82,5,Australia vs India,India,Rohit Sharma,1,lbw b Josh Hazlewood,0,6,0,0,0.0,837
156,9,Afghanistan vs India,India,Rohit Sharma,1,b Rashid Khan,131,84,16,5,156.0,763
267,12,Pakistan vs India,India,Rohit Sharma,1,c Iftikhar Ahmed b Shaheen Afridi,86,63,6,6,136.5,692
362,17,Bangladesh vs India,India,Rohit Sharma,1,c Towhid Hridoy b Hasan Mahmud,48,40,7,2,120.0,597
438,21,New Zealand vs India,India,Rohit Sharma,1,b Lockie Ferguson,46,40,4,4,115.0,520

In [47]:
# Get all batsman who scored 100 or more

In [48]:
df[df["Runs"] >= 100][["Batsman_Name","Runs"]].head()

             Batsman_Name  Runs
11           Devon Conway   152
13        Rachin Ravindra   123
53        Quinton de Kock   100
55  Rassie van der Dussen   108
56          Aiden Markram   106

In [49]:
df_zero = df["Runs"] == 0
df_balls = df["Balls"] > 0

In [50]:
df_zero.head()

0    False
1    False
2    False
3    False
4    False
Name: Runs, dtype: bool

In [51]:
df[df_zero & df_balls][["Match_Between","Batsman_Name"]].head()

                Match_Between      Batsman_Name
12     England vs New Zealand        Will Young
22    Pakistan vs Netherlands         Hasan Ali
30    Pakistan vs Netherlands     Scott Edwards
45  Afghanistan vs Bangladesh     Naveen-ul-Haq
46  Afghanistan vs Bangladesh  Fazalhaq Farooqi

In [52]:
# Get all batsman who scored between 150 or 200

In [53]:
df[df["Runs"].between(150,200)][["Batsman_Name","Runs"]].head()

        Batsman_Name  Runs
11      Devon Conway   152
367     David Warner   163
458  Quinton de Kock   174
841   Mitchell Marsh   177

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 916 entries, 0 to 915
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Match_no          916 non-null    int64
 1   Match_Between     916 non-null    object
 2   Team_Innings      916 non-null    object
 3   Batsman_Name      916 non-null    object
 4   Batting_Position  916 non-null    int64
 5   Dismissal         914 non-null    object
 6   Runs              916 non-null    int64
 7   Balls             916 non-null    int64
 8   4s                916 non-null    int64
 9   6s                916 non-null    int64
 10  Strike_Rate       916 non-null    float64
 11  Rank              916 non-null    int64
dtypes: float64(1), int64(7), object(4)
memory usage: 86.0+ KB

In [55]:
df["Match_no"] = df["Match_no"].astype('category')

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 916 entries, 0 to 915
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Match_no          916 non-null    category
 1   Match_Between     916 non-null    object
 2   Team_Innings      916 non-null    object
 3   Batsman_Name      916 non-null    object
 4   Batting_Position  916 non-null    int64
 5   Dismissal         914 non-null    object
 6   Runs              916 non-null    int64
 7   Balls             916 non-null    int64
 8   4s                916 non-null    int64
 9   6s                916 non-null    int64
 10  Strike_Rate       916 non-null    float64
 11  Rank              916 non-null    int64
dtypes: category(1), float64(1), int64(6), object(4)
memory usage: 81.2+ KB

In [57]:
df.set_index(keys="Match_no", inplace=True)

In [59]:
df.head(2)

,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
Match_no,,,,,,,,,,,
1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.3,909
1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.3,909

In [60]:
df.reset_index(drop=False, inplace=True)

In [61]:
df.head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.3,909
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.3,909

In [62]:
# Is 49 present in index

In [63]:
49 in df.index

True

In [66]:
# Get index rows from 2 to 5

In [65]:
df.loc[2:5]

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
2,1,England vs New Zealand,England,Joe Root,3,b Glenn Phillips,77,86,4,1,89.5,909
3,1,England vs New Zealand,England,Harry Brook,4,c Devon Conway b Rachin Ravindra,25,16,4,1,156.3,909
4,1,England vs New Zealand,England,Moeen Ali,5,b Glenn Phillips,11,17,1,0,64.7,909
5,1,England vs New Zealand,England,Jos Buttler,6,c Tom Latham b Matt Henry,43,42,2,2,102.4,909

In [67]:
# Get index rows 50

In [68]:
df.loc[50]

Match_no                                    3
Match_Between       Afghanistan vs Bangladesh
Team_Innings                       Bangladesh
Batsman_Name            Najmul Hossain Shanto
Batting_Position                            4
Dismissal                             not out
Runs                                       59
Balls                                      83
4s                                          3
6s                                          1
Strike_Rate                              71.1
Rank                                      872
Name: 50, dtype: object

In [69]:
# Get rows where batsman is Rohit and runs scored is >=100

In [73]:
df.loc[(df.Batsman_Name == "Rohit Sharma") & (df.Runs >= 100)].head()

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
156,9,Afghanistan vs India,India,Rohit Sharma,1,b Rashid Khan,131,84,16,5,156.0,763

In [74]:
# 50 index match

In [75]:
df.loc[50, "Match_Between"]

'Afghanistan vs Bangladesh'

In [76]:
# Get names of batsman who didn't face any balls

In [77]:
df.loc[(df.Balls == 0), ["Match_Between", "Batsman_Name"]]

                 Match_Between    Batsman_Name
426    South Africa vs England    Reece Topley
544   Australia vs New Zealand  Josh Hazlewood
577  Netherlands vs Bangladesh  Shoriful Islam
598           India vs England       Mark Wood
716       Australia vs England       Mark Wood
740    Sri Lanka vs Bangladesh  Angelo Mathews

In [78]:
# rename fields

In [80]:
df.rename(mapper = {"4s": "Fours", "6s": "Sixes"}, axis = 1).head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,Fours,Sixes,Strike_Rate,Rank
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.3,909
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.3,909

In [81]:
# drop column strike_rate

In [83]:
df.drop(["Strike_Rate"], axis=1).head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Rank
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,909
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,909

In [84]:
# Remove column from dataframe
# print(df.pop("Strike_Rate"))
# print(df.head())

In [86]:
df.sample()

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
716,36,Australia vs England,England,Mark Wood,11,not out,0,0,0,0,0.0,250

In [87]:
# Sort values by Runs in desc

In [88]:
df.sort_values(by=["Runs"], ascending=False).head(4)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
767,39,Afghanistan vs Australia,Australia,Glenn Maxwell,6,not out,201,128,21,10,157.000,193
841,43,Bangladesh vs Australia,Australia,Mitchell Marsh,3,not out,177,132,17,9,134.091,120
458,23,South Africa vs Bangladesh,South Africa,Quinton de Kock,1,c Nasum Ahmed b Hasan Mahmud,174,140,15,7,124.286,489
367,18,Australia vs Pakistan,Australia,David Warner,1,c Shadab Khan sub b Haris Rauf,163,124,14,9,131.452,578

In [89]:
# Top 5 most runs scored

In [91]:
df.nlargest(2, columns=["Runs"])

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
767,39,Afghanistan vs Australia,Australia,Glenn Maxwell,6,not out,201,128,21,10,157.000,193
841,43,Bangladesh vs Australia,Australia,Mitchell Marsh,3,not out,177,132,17,9,134.091,120

In [92]:
# Top 5 least runs scored by Rohit

In [93]:
df[df["Batsman_Name"] == "Rohit Sharma"].nsmallest(5, columns=["Runs"])

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
82,5,Australia vs India,India,Rohit Sharma,1,lbw b Josh Hazlewood,0,6,0,0,0.000,837
648,33,India vs Sri Lanka,India,Rohit Sharma,1,b Dilshan Madushanka,4,2,1,0,200.000,298
717,37,India vs South Africa,India,Rohit Sharma,1,c Temba Bavuma b Kagiso Rabada,40,24,6,2,166.700,230
438,21,New Zealand vs India,India,Rohit Sharma,1,b Lockie Ferguson,46,40,4,4,115.000,520
882,46,India vs New Zealand,India,Rohit Sharma,1,c Kane Williamson b Tim Southee,47,29,4,4,162.069,66

In [102]:
df.columns

Index(['Match_no', 'Match_Between', 'Team_Innings', 'Batsman_Name',
       'Batting_Position', 'Dismissal', 'Runs', 'Balls', '4s', '6s',
       'Strike_Rate', 'Rank'],
      dtype='object')

In [103]:
# Batsmans who hit more than 5 sixes

In [107]:
df.where(df["6s"] > 5.0).dropna().sort_values(by="6s", ascending=False).head(3)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
693,35,New Zealand vs Pakistan,Pakistan,Fakhar Zaman,2.0,not out,126.0,81.0,8.0,11.0,155.600,267.0
767,39,Afghanistan vs Australia,Australia,Glenn Maxwell,6.0,not out,201.0,128.0,21.0,10.0,157.000,193.0
367,18,Australia vs Pakistan,Australia,David Warner,1.0,c Shadab Khan sub b Haris Rauf,163.0,124.0,14.0,9.0,131.452,578.0

In [108]:
# Rohit innings with more runs more than 50

In [109]:
df.query("Batsman_Name == 'Rohit Sharma' and Runs > 50")

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
156,9,Afghanistan vs India,India,Rohit Sharma,1,b Rashid Khan,131,84,16,5,156.000,763
267,12,Pakistan vs India,India,Rohit Sharma,1,c Iftikhar Ahmed b Shaheen Afridi,86,63,6,6,136.500,692
578,29,India vs England,India,Rohit Sharma,1,c Liam Livingstone b Adil Rashid,87,101,10,3,86.100,368
865,45,India vs Netherlands,India,Rohit Sharma,1,c Wesley Barresi b Bas de Leede,61,54,8,2,112.963,83

In [110]:
# Get Teams

In [112]:
df["Team_Innings"].unique()

array(['England', 'New Zealand', 'Pakistan', 'Netherlands', 'Afghanistan',
       'Bangladesh', 'South Africa', 'Sri Lanka', 'Australia', 'India'],
      dtype=object)

In [113]:
# Get record of max runs scored by batsman

In [117]:
df.iloc[df["Runs"].idxmax()]

Match_no                                  39
Match_Between       Afghanistan vs Australia
Team_Innings                       Australia
Batsman_Name                   Glenn Maxwell
Batting_Position                           6
Dismissal                            not out
Runs                                     201
Balls                                    128
4s                                        21
6s                                        10
Strike_Rate                            157.0
Rank                                     193
Name: 767, dtype: object

In [115]:
df["Runs"].idxmax()

767

In [119]:
df.iloc[df["Runs"].idxmax()], df["Runs"].idxmax()

(Match_no                                  39
 Match_Between       Afghanistan vs Australia
 Team_Innings                       Australia
 Batsman_Name                   Glenn Maxwell
 Batting_Position                           6
 Dismissal                            not out
 Runs                                     201
 Balls                                    128
 4s                                        21
 6s                                        10
 Strike_Rate                            157.0
 Rank                                     193
 Name: 767, dtype: object,
 767)

In [120]:
# Get Teams in lower case

In [124]:
df["Team_Innings"].drop_duplicates().str.lower()

0          england
11     new zealand
14        pakistan
25     netherlands
36     afghanistan
47      bangladesh
53    south africa
60       sri lanka
71       australia
82           india
Name: Team_Innings, dtype: object

In [125]:
# timestamp of 2023-02-11

In [126]:
pd.Timestamp("2023-02-11")

Timestamp('2023-02-11 00:00:00')

In [127]:
# timestamp of 2023-02

In [128]:
pd.Period("2023-02")

Period('2023-02', 'M')

In [129]:
#To convert string date field to datetime type 
#pd.to_datetime(df["date_column"])

In [132]:
# Statistics of Runs scored by Rohit Sharma

In [131]:
df.loc[(df["Batsman_Name"] == "Rohit Sharma"), ["Batsman_Name", "Runs"]].describe()

             Runs
count   11.000000
mean    54.272727
std     37.282948
min      0.000000
25%     43.000000
50%     47.000000
75%     73.500000
max    131.000000

In [133]:
# Std of runs scored by Rohit Sharma

In [134]:
df.loc[(df["Batsman_Name"] == "Rohit Sharma"), ["Batsman_Name", "Runs"]].std(numeric_only=True)

Runs    37.282948
dtype: float64

In [135]:
# Median of runs scored by Rohit Sharma

In [136]:
df.loc[(df["Batsman_Name"] == "Rohit Sharma"), ["Batsman_Name", "Runs"]].median(numeric_only=True)

Runs    47.0
dtype: float64